### PANDAS

### Importing Pandas library

In [6]:
def pname():
    print("4SF20CI002 : ABHIJITH MALLYA")

In [7]:
import pandas as pd

### Creating a Pandas Series

In [8]:
pname()
series = pd.Series([1,2,3,4,5])
series

4SF20CI002 : ABHIJITH MALLYA

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Creating a Pandas DataFrame

In [14]:
pname()
data = {'Name': ['John', 'Emily', 'Michael'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print("Data Frame created successfully !")

4SF20CI002 : ABHIJITH MALLYA
Data Frame created successfully !

### Viewing the first few rows of a DataFrame

In [15]:
pname()
df.head()

4SF20CI002 : ABHIJITH MALLYA

      Name  Age         City
0     John   25     New York
1    Emily   30  Los Angeles
2  Michael   35      Chicago

### Accessing a column in a DataFrame

In [16]:
pname()
df['City']

4SF20CI002 : ABHIJITH MALLYA

0       New York
1    Los Angeles
2        Chicago
Name: City, dtype: object

### Filtering Rows based  on a condition

In [17]:
pname()
filtered_df = df[df['Age'] > 30]
filtered_df

4SF20CI002 : ABHIJITH MALLYA

      Name  Age     City
2  Michael   35  Chicago

### Sorting a DataFrame by a Column

In [18]:
pname()
sorted_df = df.sort_values('Age')
sorted_df

4SF20CI002 : ABHIJITH MALLYA

      Name  Age         City
0     John   25     New York
1    Emily   30  Los Angeles
2  Michael   35      Chicago

### Performing statistical calculations in a Column

In [19]:
pname()
average_age = df['Age'].mean()
print("Average age :"+str(average_age))

4SF20CI002 : ABHIJITH MALLYA
Average age :30.0

### Adding a new Column to a DataFrame

In [20]:
pname()
df['Gender'] = ['Male', 'Female', 'Male']

4SF20CI002 : ABHIJITH MALLYA

### Grouping and agregating data in a DataFrame

In [22]:
pname()
grouped_df = df.groupby('Gender').mean()
grouped_df

4SF20CI002 : ABHIJITH MALLYA

C:\Users\ABHIJITH_MALLYA\AppData\Local\Temp\ipykernel_13152\3191940500.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped_df = df.groupby('Gender').mean()

         Age
Gender
Female  30.0
Male    30.0